# Microsemi Corp.
# Date: 2024-Jan-29 12:09:36
# This file was generated based on the following SDC source files:
#   C:/MicroSemiProj/EvalBoardSandbox/constraint/EvalBoardSandbox_derived_constraints.sdc
#

create_clock -name {EvalSandbox_MSS_0/EvalSandbox_MSS_MSS_0/CLK_CONFIG_APB} -period 40 [ get_pins { EvalSandbox_MSS_0/EvalSandbox_MSS_MSS_0/MSS_ADLIB_INST/INST_MSS_010_IP/CLK_CONFIG_APB } ]
create_clock -name {EvalSandbox_MSS_0/FABOSC_0/I_RCOSC_25_50MHZ/CLKOUT} -period 20 [ get_pins { EvalSandbox_MSS_0/FABOSC_0/I_RCOSC_25_50MHZ/CLKOUT } ]
create_generated_clock -name {EvalSandbox_MSS_0/CCC_0/GL0} -multiply_by 4 -divide_by 2 -source [ get_pins { EvalSandbox_MSS_0/CCC_0/CCC_INST/INST_CCC_IP/RCOSC_25_50MHZ } ] -phase 0 [ get_pins { EvalSandbox_MSS_0/CCC_0/CCC_INST/INST_CCC_IP/GL0 } ]
set_false_path -through [ get_pins { EvalSandbox_MSS_0/CORECONFIGP_0/INIT_DONE_q1/D } ]
set_false_path -through [ get_nets { EvalSandbox_MSS_0/CORERESETP_0/ddr_settled EvalSandbox_MSS_0/CORERESETP_0/count_ddr_enable EvalSandbox_MSS_0/CORERESETP_0/release_sdif*_core } ]
set_false_path -from [ get_cells { EvalSandbox_MSS_0/CORERESETP_0/MSS_HPMS_READY_int } ] -to [ get_cells { EvalSandbox_MSS_0/CORERESETP_0/sm0_areset_n_rcosc EvalSandbox_MSS_0/CORERESETP_0/sm0_areset_n_rcosc_q1 } ]
set_false_path -from [ get_cells { EvalSandbox_MSS_0/CORERESETP_0/MSS_HPMS_READY_int } ] -to [ get_cells { EvalSandbox_MSS_0/CORERESETP_0/sdif*_areset_n_rcosc* } ]
set_false_path -through [ get_pins { EvalSandbox_MSS_0/CORERESETP_0/CONFIG1_DONE_q1/D EvalSandbox_MSS_0/CORERESETP_0/CONFIG2_DONE_q1/D EvalSandbox_MSS_0/CORERESETP_0/SOFT_RESET_F2M_keep_RNI5G11/A EvalSandbox_MSS_0/CORERESETP_0/SOFT_M3_RESET_keep_RNI0S1D/A } ]
set_false_path -through [ get_pins { EvalSandbox_MSS_0/EvalSandbox_MSS_MSS_0/MSS_ADLIB_INST/INST_MSS_010_IP/CONFIG_PRESET_N } ]
set_false_path -through [ get_pins { EvalSandbox_MSS_0/SYSRESET_POR/INST_SYSRESET_FF_IP/POWER_ON_RESET_N } ]
set_min_delay -24 -through [ get_pins { EvalSandbox_MSS_0/CORECONFIGP_0/control_reg_15_1/B EvalSandbox_MSS_0/CORECONFIGP_0/pwrite/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg4/B EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[13]/A EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[11]/A EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[8]/A EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[6]/A EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[7]/A EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[12]/A EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[3]/A EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[14]/A EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[10]/A EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[2]/A EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[4]/A EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[15]/A EvalSandbox_MSS_0/CORECONFIGP_0/int_prdata_1[1]/A EvalSandbox_MSS_0/CORECONFIGP_0/int_prdata_1[16]/A EvalSandbox_MSS_0/CORECONFIGP_0/FIC_2_APB_M_PADDR_keep_RNI4KH7[3]/C EvalSandbox_MSS_0/CORECONFIGP_0/int_prdata_2[0]/A EvalSandbox_MSS_0/CORECONFIGP_0/FIC_2_APB_M_PRDATA_RNO[17]/A EvalSandbox_MSS_0/CORECONFIGP_0/control_reg_15/A EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[5]/A EvalSandbox_MSS_0/CORECONFIGP_0/int_prdata[1]/A EvalSandbox_MSS_0/CORECONFIGP_0/paddr[2]/D EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[9]/A EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[9]/B EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[13]/B EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[11]/B EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[8]/B EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[6]/B EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[7]/B EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[12]/B EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[3]/B EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[14]/B EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[10]/B EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[2]/B EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[4]/B EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[15]/B EvalSandbox_MSS_0/CORECONFIGP_0/int_prdata_1[1]/B EvalSandbox_MSS_0/CORECONFIGP_0/int_prdata_1[16]/C EvalSandbox_MSS_0/CORECONFIGP_0/FIC_2_APB_M_PRDATA_RNO[16]/B EvalSandbox_MSS_0/CORECONFIGP_0/FIC_2_APB_M_PADDR_keep_RNI4KH7[3]/B EvalSandbox_MSS_0/CORECONFIGP_0/FIC_2_APB_M_PRDATA_RNO[17]/D EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[5]/D EvalSandbox_MSS_0/CORECONFIGP_0/paddr[3]/D EvalSandbox_MSS_0/CORECONFIGP_0/control_reg_15_2/A EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[9]/C EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[13]/C EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[11]/C EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[8]/C EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[6]/C EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[7]/C EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[12]/C EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[3]/C EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[14]/C EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[10]/C EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[2]/C EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[4]/C EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[15]/C EvalSandbox_MSS_0/CORECONFIGP_0/int_prdata_1[1]/C EvalSandbox_MSS_0/CORECONFIGP_0/int_prdata_1[16]/B EvalSandbox_MSS_0/CORECONFIGP_0/control_reg_15_2/B EvalSandbox_MSS_0/CORECONFIGP_0/FIC_2_APB_M_PADDR_keep_RNI4KH7[3]/A EvalSandbox_MSS_0/CORECONFIGP_0/FIC_2_APB_M_PRDATA_RNO[17]/C EvalSandbox_MSS_0/CORECONFIGP_0/prdata_0_iv_RNO[5]/C EvalSandbox_MSS_0/CORECONFIGP_0/paddr[4]/D EvalSandbox_MSS_0/CORECONFIGP_0/FIC_2_APB_M_PRDATA_RNO[16]/A EvalSandbox_MSS_0/CORECONFIGP_0/paddr[5]/D EvalSandbox_MSS_0/CORECONFIGP_0/paddr[6]/D EvalSandbox_MSS_0/CORECONFIGP_0/paddr[8]/D EvalSandbox_MSS_0/CORECONFIGP_0/paddr[9]/D EvalSandbox_MSS_0/CORECONFIGP_0/paddr[12]/D EvalSandbox_MSS_0/CORECONFIGP_0/paddr[15]/D EvalSandbox_MSS_0/CORECONFIGP_0/paddr[7]/D EvalSandbox_MSS_0/CORECONFIGP_0/paddr[10]/D EvalSandbox_MSS_0/CORECONFIGP_0/paddr[13]/D EvalSandbox_MSS_0/CORECONFIGP_0/control_reg_1[1]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[1]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[1]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[3]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[3]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[4]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[4]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[5]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[5]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[6]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[6]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[7]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[7]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[8]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[8]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[11]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[11]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[13]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[13]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[14]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[14]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[16]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[15]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[15]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[10]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[10]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[9]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[9]/D EvalSandbox_MSS_0/CORECONFIGP_0/control_reg_1[0]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[0]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[0]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[12]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[12]/D EvalSandbox_MSS_0/CORECONFIGP_0/pwdata[2]/D EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg[2]/D EvalSandbox_MSS_0/CORECONFIGP_0/next_state5/B EvalSandbox_MSS_0/CORECONFIGP_0/next_state5/A EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg4/A EvalSandbox_MSS_0/CORECONFIGP_0/control_reg_15_1/A } ]
set_min_delay 0 -through [ get_pins { EvalSandbox_MSS_0/CORECONFIGP_0/next_state5/B EvalSandbox_MSS_0/CORECONFIGP_0/next_state5/A EvalSandbox_MSS_0/CORECONFIGP_0/soft_reset_reg4/A EvalSandbox_MSS_0/CORECONFIGP_0/control_reg_15_1/A } ] -to [ get_cells { EvalSandbox_MSS_0/CORECONFIGP_0/FIC_2_APB_M_PREADY* EvalSandbox_MSS_0/CORECONFIGP_0/state[0] } ]
