set_device -family {SmartFusion2} -die {M2S025} -speed {STD}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\CGraphDmTypes.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\CGraphDmDacRamFlat.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\IBufP1.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\IBufP2.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\IBufP3.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\UartRxRaw.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\UartRxExtClk.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\fifo_gen.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\gated_fifo.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\UartRxFifoExtClk.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\UartTx.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\UartTxFifoExtClk.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\VariableClockDivider2X.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\ClockDivider2X.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\OneShot.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\hdl\RegisterSpace.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\SpiMaster.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\include\fpga\SpiDac.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\hdl\DMMain.vhd}
read_verilog -mode system_verilog {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\work\EvalSandbox_MSS\CCC_0\EvalSandbox_MSS_CCC_0_FCCC.v}
read_verilog -mode system_verilog {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\work\EvalSandbox_MSS\FABOSC_0\EvalSandbox_MSS_FABOSC_0_OSC.v}
read_verilog -mode system_verilog {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\work\EvalSandbox_MSS_MSS\EvalSandbox_MSS_MSS.v}
read_verilog -mode system_verilog {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\Actel\DirectCore\CoreResetP\7.1.100\rtl\vlog\core\coreresetp_pcie_hotreset.v}
read_verilog -mode system_verilog {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\Actel\DirectCore\CoreResetP\7.1.100\rtl\vlog\core\coreresetp.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_muxptob3.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_iaddr_reg.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3.v}
read_verilog -mode system_verilog {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\work\EvalSandbox_MSS\EvalSandbox_MSS.v}
read_verilog -mode system_verilog {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\work\FCCC_C0\FCCC_C0_0\FCCC_C0_FCCC_C0_0_FCCC.v}
read_verilog -mode system_verilog {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\work\FCCC_C0\FCCC_C0.v}
read_verilog -mode system_verilog {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\work\IO_C2\IO_C2_0\IO_C2_IO_C2_0_IO.v}
read_verilog -mode system_verilog {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\work\IO_C2\IO_C2.v}
read_verilog -mode system_verilog {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\work\EvalBoardSandbox\EvalBoardSandbox.v}
set_top_level {EvalBoardSandbox}
read_sdc -component {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\work\COREFIFO_C0\COREFIFO_C0_0\COREFIFO_C0_COREFIFO_C0_0_COREFIFO.sdc}
read_sdc -component {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\work\EvalSandbox_MSS\CCC_0\EvalSandbox_MSS_CCC_0_FCCC.sdc}
read_sdc -component {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\work\EvalSandbox_MSS\FABOSC_0\EvalSandbox_MSS_FABOSC_0_OSC.sdc}
read_sdc -component {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\work\EvalSandbox_MSS_MSS\EvalSandbox_MSS_MSS.sdc}
read_sdc -component {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\component\work\FCCC_C0\FCCC_C0_0\FCCC_C0_FCCC_C0_0_FCCC.sdc}
derive_constraints
write_sdc {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\constraint\EvalBoardSandbox_derived_constraints.sdc}
write_ndc {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\constraint\EvalBoardSandbox_derived_constraints.ndc}
write_pdc {C:\Users\SKaye\repos7\firmware\DMInterface\Ux1_Ver2\constraint\fp\EvalBoardSandbox_derived_constraints.pdc}
